Repository: patyotaus-gif/restaurant_app_final
Catalog: lib/l10n/app_*.arb
Languages: th

# appTitle
source: Restaurant POS
th: ระบบ POS ร้านอาหาร

# languagePickerLabel
source: Language
th: ภาษา

# languagePickerSystem
source: System default
th: ตามค่าระบบ

# languageEnglish
source: English
th: อังกฤษ

# languageThai
source: Thai
th: ไทย

# pinLoginTitle
source: Enter PIN
th: กรอกรหัส PIN

# pinLoginInstructions
source: Please enter your 4-digit PIN
th: กรุณากรอกรหัส PIN 4 หลัก

# pinLoginInvalidPin
source: Invalid PIN. Please try again.
th: รหัส PIN ไม่ถูกต้อง กรุณาลองอีกครั้ง

# pinLoginLoginButton
source: Login
th: เข้าสู่ระบบ

# checkoutCopyLink
source: Copy link
th: คัดลอกลิงก์

# checkoutCopyLinkSuccess
source: Link copied to clipboard
th: คัดลอกลิงก์เรียบร้อยแล้ว

# checkoutAppliedPaymentsTitle
source: Applied Payments
th: รายการชำระเงินที่ใช้

# checkoutPaymentUnknownMethod
source: Unknown
th: ไม่ทราบ

# checkoutPaymentReference
source: Ref: {reference}
th: อ้างอิง: {reference}

# ingredientDialogCreateTitle
source: Add ingredient
th: เพิ่มวัตถุดิบ

# ingredientDialogEditTitle
source: Edit ingredient
th: แก้ไขวัตถุดิบ

# ingredientFieldNameLabel
source: Ingredient name
th: ชื่อวัตถุดิบ

# ingredientFieldNameValidation
source: Please enter a name
th: กรุณากรอกชื่อ

# ingredientFieldUnitLabel
source: Unit (e.g. kg, g, pcs)
th: หน่วยนับ (เช่น กก., กรัม, ชิ้น)

# ingredientFieldUnitValidation
source: Please enter a unit
th: กรุณากรอกหน่วยนับ

# ingredientFieldStockLabel
source: Stock quantity
th: จำนวนคงเหลือ

# ingredientFieldStockValidation
source: Please enter a quantity
th: กรุณากรอกจำนวน

# ingredientFieldCostLabel
source: Average cost per unit
th: ต้นทุนเฉลี่ยต่อหน่วย

# ingredientFieldCostValidation
source: Please enter a cost
th: กรุณากรอกต้นทุน

# ingredientFieldThresholdLabel
source: Low stock threshold
th: จุดเตือนสต็อกต่ำ

# ingredientFieldThresholdValidation
source: Please enter a threshold
th: กรุณากรอกจุดเตือน

# commonCancel
source: Cancel
th: ยกเลิก

# commonSave
source: Save
th: บันทึก

# commonDelete
source: Delete
th: ลบ

# ingredientDeleteTitle
source: Delete ingredient
th: ยืนยันการลบ

# ingredientDeleteMessage
source: Are you sure you want to delete this item?
th: คุณต้องการลบรายการนี้หรือไม่

# ingredientPageTitle
source: Ingredient inventory
th: จัดการสต็อกวัตถุดิบ

# ingredientAddPurchaseOrderTooltip
source: Add purchase order
th: สร้างใบสั่งซื้อ

# ingredientListError
source: Error: {message}
th: เกิดข้อผิดพลาด: {message}

# ingredientListEmpty
source: No ingredients found
th: ยังไม่มีวัตถุดิบในระบบ

# ingredientSummary
source: {quantity} {unit} (Avg. cost: {avgCost})
th: {quantity} {unit} (ต้นทุนเฉลี่ย: {avgCost})

# ingredientFabTooltip
source: Add ingredient
th: เพิ่มวัตถุดิบ

# unitKilogram
source: kg
th: กก.

# unitGram
source: g
th: กรัม

# unitLiter
source: L
th: ลิตร

# unitMilliliter
source: mL
th: มิลลิลิตร

# unitPiece
source: pc
th: ชิ้น
